In [1]:
import numpy as np
import pandas as pd

In [4]:
mno=pd.read_csv('xyz.csv')

In [5]:
mno

   Unnamed: 0  Train  Speed City
0           1   1458    135  bwn
1           2   9957    105  jpg
2           3   4587     95  rnc
3           4   3255    180  jpe

In [6]:
mno.index=["first","second","third","fourth"]

In [7]:
mno

        Unnamed: 0  Train  Speed City
first            1   1458    135  bwn
second           2   9957    105  jpg
third            3   4587     95  rnc
fourth           4   3255    180  jpe